const store = {
	contacts: {
		phone: '0683291751',
		email: 'primepiazza@gmail.com',
		inst: 'http://instagram.com',
		fb: 'http://facebook.com',
		map: 'https://www.google.com/maps/',
		address: 'м. Одеса, вул. Героїв України, 100',
		time: 'Щодня 10:00 - 22:00',
	},
	promotionals: [
		{
			img: 'img/promotional/Offer1+1.webp',
			title: '1 + 1 = 3',
			text: 'Акційна пропозиція! Замов 2 будь-які піци та отримай третю у подарунок!',
			textWarning: 'Увага, акції не сумуються!',
		},
		{
			img: 'img/promotional/OfferCola.webp',
			title: '1 + 1 = Кола(0,5л.)',
			text: 'Акційна пропозиція! Замов 2 будь-які піци та отримай колу 0,5 л. подарунок!',
			textWarning: 'Увага, акції не сумуються!',
		},
		{
			img: 'img/promotional/Offer-15.webp',
			title: '-15% на самовиніс',
			text: 'Акційна пропозиція! Отримай знижку 15% на усе замовлениия якщо забереш його самостійно!',
			textWarning: 'Увага, акції не сумуються!',
		},
		{
			img: 'img/promotional/OfferCoffee.webp',
			title: '-20% на ранкову каву',
			text: 'Акційна пропозиція! Отримай знижку 20% на ранкову каву!',
			textWarning: 'Увага, акції не сумуються!',
		},
	],
	about: [
		{
			img: 'img/about/1.webp',
			title: 'Молода та амбіційна команда',
			text: 'Молода та амбіційна піцерія з досвідом приготування піци більше як три роки. З кождним днем ми вдосконалюємося, щоб заполонити серця голодних людей. При думці "хочу поїсти" нагадувалось Prime..... місце де швидко, смачно, тепло та багато приємних спогадів....',
		},
		{
			img: 'img/about/2.webp',
			title: 'Піцца від якої хочеться жити',
			text: 'Ми використовуємо свіжі і якісні інгредієнти, щоб смакувало завжди по особливому, ніжна моцарелла, основа на ваш вибір, смакують бездоганно. Prime дбає про своїх гостей і вижимає максимум з кожного продукту. Якщо ви шукаєте місце де не просто	“перекусити”, а отримати насолоду, замовляйте доставку або приходьте в гості. Раді вас бачити, нагодувати і зігріти в такий нелегкий для всіх час',
		},
		{
			img: 'img/about/3.webp',
			title: 'Швидко та смачно',
			text: 'Prime продумано налаштувала ефективне приготування страв, щоб це було максимально швидко та смачно. Prime - цінує ваш дорогоцінний час і пропонує надшвидке приготування, якщо ви ще сумніваєтесь ми готові розвіяти сумніви. Замовляйте доставку і засікайте час',
		},
		{
			img: 'img/about/4.webp',
			title: 'Особливий рецепт',
			text: 'Особливий рецепт приготування - любов. Що може бути кращим? Prime - має унікальний рецепт приготування, в який входить секретний інгредієнт про який не знає ніхто! Секретний інгредієнт - секретний і його можна тільки скуштувати, хочеш дізнатися секрет, замовляй доставку піци і дізнавайся за смаком',
		},
	],
}

export default store
